**Дополнительное задание.**
<br>Создайте класс **Rectangle**.
<br>Создайте две целочисленные переменные и задайте им некоторые значения. Применяя технику
вложенных циклов, нарисуйте прямоугольник из звездочек. Используйте значения ранее созданных
переменных для указания высоты и ширины прямоугольника.

**Задание 2**
<br>Создайте класс **SumMin**.
<br>Дано два числа A и B (A<B) выведите суму всех чисел, расположенных между данными числами на экран.
<br>Дано два числа A и B (A<B) выведите все нечетные значения, расположенные между данными числами.

**Задание 3**
<br>Используя IntelliJ IDEA, создайте класс.
<br>Используя циклы и метод:
<br>```System.out.print("*"), System.out.print (" "), System.out.print ("\n")```
(для перехода на новую строку).
<br>Выведите на экран:
* прямоугольник
* прямоугольный треугольник
* равносторонний треугольник
* ромб

**Задание 4**
<br>Имеется N клиентов, которым компания производитель должна доставить товар. Сколько существует
возможных маршрутов доставки товара, с учетом того, что товар будет доставлять одна машина?
<br>Создайте класс **Delivery**.
<br>Напишите программу, которая будет рассчитывать, и выводить на экран количество возможных
вариантов доставки товара. Для решения задачи, используйте факториал N!, рассчитываемый с помощью
цикла do-while.